{
    "__doc__": "All changes require a restart to take effect",
    "WK_API_KEY__doc__": "Your WaniKani API key. Requires all_data:read, assignments:start, and reviews:create permissions",
    "WK_API_KEY": "",
    "NOTE_TYPE_NAME__doc__": "The name of the note type for WaniKani subjects",
    "NOTE_TYPE_NAME": "WaniKani",
    "DECK_NAME__doc__": "The deck or sub-deck to store WaniKani cards in",
    "DECK_NAME": "WaniKani",
    "SYNC_ALL__doc__": "If true, attempts to create notes for all WaniKani subjects. If false, only attempts to create notes for unlocked subjects",
    "SYNC_ALL": true,
    "GURU_INTERVAL__doc__": "The interval in days required for cards to be considered Guru, and unlock dependent notes",
    "GURU_INTERVAL": 5,
    "AUTO_SYNC__doc__": "If true, automatically attempt to sync changes to subjects from WaniKani at startup",
    "AUTO_SYNC": false,
    "FETCH_CONTEXT_PATTERNS__doc__": "If true, fetch context patterns from WaniKani web pages.",
    "FETCH_CONTEXT_PATTERNS": true,
    "LESSONS_SYNC_INTERVAL__doc__": "The amount of time to wait between checking for new subjects that are available for lessons which have already been reviewed in Anki. Possible keys are weeks, days, hours, minutes, seconds, milliseconds, and microseconds (as accepted by the Python datetime.timedelta constructor).",
    "SYNC_INTERVAL_LESSONS": {"hours": 1},
    "SYNC_INTERVAL_DUE__doc__": "The amount of time to wait between syncing assignment due times and intervals from WaniKani. The format is the same as for the SYNC_INTERVAL_LESSONS key.",
    "SYNC_INTERVAL_DUE": {"hours": 1},
    "SYNC_INTERVAL_REVIEWS_MAX__doc__": "The longest time to wait before attempting to sync available reviews. We always attempt to sync reviews as soon as the assignment becomes available. If we don't find any available assignments within the time period of this interval, we will attempt to sync all available reviews at the end of the interval. The format is the same as for the SYNC_INTERVAL_LESSONS key.",
    "SYNC_INTERVAL_REVIEWS_MAX": {"days": 1},
    "UNLOCK_EXTRA_LEVELS_KANJI__doc__": "Unlock Kanji subjects this many levels above the current level.",
    "UNLOCK_EXTRA_LEVELS_KANJI": 0,
    "UNLOCK_EXTRA_LEVELS_RADICAL__doc__": "Unlock Radical subjects this many levels above the current level. Recommended to be one greater than the kanji level so that all of a level's kanji can be unlocked at the start of the level.",
    "UNLOCK_EXTRA_LEVELS_RADICAL": 1,
    "UNLOCK_EXTRA_LEVELS_VOCAB__doc__": "Unlock Vocabulary subjects this many levels above the current level.",
    "UNLOCK_EXTRA_LEVELS_VOCAB": 0,
    "LEVEL_COMPLETE_RATIO__doc__": "The proportion of Kanji cards which need to reach Guru status (as determined by the GURU_INTERVAL key) before the level is considered complete. The default value of 0.9 means that 90% of Kanji notes in a level need to reach Guru status before advancing to the next level.",
    "LEVEL_COMPLETE_RATIO": 0.9,
    "_current_level__doc__": "For internal use only. The current user level.",
    "_current_level": 1,
    "_last_subjects_sync__doc__": "For internal use only. The timestamp of the last downstream sync of subject data from WaniKani.",
    "_last_subjects_sync": "",
    "_last_assignments_sync__doc__": "For internal use only. The timestamp of the last downstream sync of assignment data from WaniKani.",
    "_last_assignments_sync": "",
    "_last_lessons_sync__doc__": "For internal use only. The timestamp of the last downstream sync of available lessons from WaniKani.",
    "_last_lessons_sync": "",
    "_last_due_sync__doc__": "For internal use only. The timestamp of the last downstream sync of review intervals and due times from WaniKani.",
    "_last_due_sync": ""
}
